#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "1be2ceca41c24b1d31bc89b0ca9dac3e" -> "50018071ec40e783f00ee6b3db102c6a"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "16dfc042ec782f0a4d72e82cbce58cc4" -> "725e3bcadb39b9a45f6399371453b75b"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "b7ea9969ef58cd53a7835364208bc0c3" -> "60fecb90efe3058a7b89e97f419610a8"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "8b77a1f7ad6d7c4cb05c2e4e27836f40" -> "c9c6b19219e63dd6b653380d60aaea63"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "d76f9645b23236689e01c6c9c572990f" -> "ff469135be27764dbe6329d16f60461f"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "40fce44b33d2c097b6032055432403ec" -> "f434e6c21e6f6471e59aa0e99f79a49e"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "71191a0425eecc6bef1db49db322db55" -> "cfe14d70907faa012621ae60d41dc032"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "3bb2da7aaf36e5729c4650baf175ef3b" -> "ebab547da50b0b20e7178104288e5d49"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "65ac27e75ac4e7261107a069b038abb0" -> "4f18d3c5c50d19989953620fa8bde328"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "918ce52f115e0fa20ce83d3836207c09" -> "40d6821b7aa70c86b122f616b73d1bba"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "662c357a85af01a4379cf4811cb2e3c2" -> "0e46bf7a31887a6e705969845e176bc4"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "523b770bf07e08503e81c3f6087f2d13" -> "1cfdd65f0c789790ef12dc1fa9120354"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "68f88a9745e8ccb30b01b0862f56f9c8" -> "fef8bd8dc295845a6af0b8e898122ea2"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "0b059ca8536ea2b111978a90b4b2b174" -> "af262aa6f4a781e2974e5465034a0125"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "1f4320e070a8a3552f7839143541eea6" -> "04c33403d956e59734b2e5be6cdbf6d3"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "4f09a0cd7e8c7f060e49f35daea9a1c7" -> "5dc43ee212cd41675dfeff9a8faf0214"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "f0e54b9bca3aae4576b7748be4118fba" -> "342d592e38749d3177846fe323272449"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "cd5ef6e0a70212640df3816710309106" -> "ceec4eaa4043cd8f0744cfa99c5a82fe"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "e8c02a3806e3a7a38bc5c1b9245824fe" -> "fddbcfac6fa64ba20b519dab35dc0156"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "6f6404e590ca7329c291bbd7ca9c2e2e" -> "641d01b009d4720dc2b169cc7377afa4"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "aefe28017c94058c5306e7846eb5b85b" -> "61a00f663c98f8feec2d0c8b6b6a648d"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "183bd6c28c286b1a75581b42aff2efea" -> "379914a1c94efbd14513f6819d46f606"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "3475c3b0460254e891944e4bd5d55d2d" -> "93f9b0d0cc271b426c5fc0e4d7910625"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "a50652519174bd99ef07ce317e3e7aa8" -> "5af0824ff12416cc8ee44c38de95be6d"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "b7905316d2adcd45c87b61c9fcdc2308" -> "c47692cedad3a347618da125f54be95c"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "9c75d1b2e3cc5dd7e76eb81ee20921a0" -> "e5a70ee01511d74ab536142a27f7e187"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "7f66e3ef6f41617d8712a3ddc21cada7" -> "6dce3284456954a140f8ea14e19e1048"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "5b4f81992f27b3a31960aa618a2f3ecc" -> "4a222fdb448fcedf953ef45f908dfcde"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "2bc42e1871125963d734eac22fed0225" -> "266ce55e2349db6ec4385f26cfdbb536"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "4ad227eb3e74a85574d3b54699ac421c" -> "bdbb8855e14e4f292dddcbd1ef08876f"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "fc00a560b243e84c99e609eacdc40677" -> "523aa200f0781e7cc8034997cec6833b"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "42ca2fb692552bf2775aef3e54f1236c" -> "0a15c1ee912e89f64d3feabebf3b3634"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "c26f8703675c3928dd1ec38c411e852a" -> "a38f47a0431873921d09ad88fd28f3d5"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "f0cf3cb7f2ef475fcb6f24a7ead92574" -> "817f0eb2cedd60341bf819fb51291cc8"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "1c5f3a44581789f39a86322b471f4bf5" -> "18a0b80608458dcb481c2693c36e24a8"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "02cd987236dcb82ad3132368a7ad922a" -> "9f52411111e38c9f0986d3834e0a1868"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "b0250ce808ed4e3417c67728e91a6135" -> "0911e057d72fb368acecae26400f8882"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "9cf4711f41c324d42b88b55538569865" -> "fc4885b67497290a5819c1d93d08b0ba"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "baf5556041fa35d121ff5d23df01a9e8" -> "891f6dc1a34a05068aa9277d0953a703"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "80deeff267036c7db43c2231f7ed0655" -> "1c01f3e10fedc89c811855f6de7be37c"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "3227dc25a31564a1bf949811d978f518" -> "f1c2d9c48fa44b344a088e4bd46fa981"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "dbc043a7e7081aefb875a88dee8b9ea5" -> "0e9f5fda07c73e661fc676211a72d938"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "L0l9w/LUOnAPWeRWWpFGqYRSCM4x4ZbSFG2+sSGWfGE=" -> "6FqWNBhk2YPPrV/aFGDBFHUbero/TCGjYgINBqgsigQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "ouO1/siMWws+Tg/UVNTFy5pvkoNcBC1e47GJFAKpS/U=" -> "49DGszDQWCoFzRDjlZgd4VjUTBEhesxmZoIRB2nCVW8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:29.815+0000" -> (known after apply)
      ~ source_code_hash               = "9b3Aoay3AHTLFekjpOIQlYNPuHlqUUPMUjLrekgqUOM=" -> "ffK7mOBq4+5NkFWk2QENx5L3xiwm82O5CG3air79SHE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "zJnuuxEd53dB+c02lrQzKbxxVV91bzbEh6SxTO3K6RM=" -> "9iEQoSiCok1CONgC3bibr42ttqPYtG5SCj6kQYqmzDc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "m5PqWZaAB/3Ipw8SJLO6ROAPky+twfdXXVXEXmgRrNk=" -> "E0DtJ9GIba/x96JKh1T/QxjO+VSjVA/qcUIT8+Yo78c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "AXxEalKVwy/Lq2S3TEElM+Z8UE+3kIU9nEr8Hvb2fqU=" -> "xr4IRhZg8aq37qByr7hc7wL1n91v/uTPLHthQfYg7VU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "ueXTXYAcQZNfvoEm/kFTjCmdc8AoEEZszXhn7xlmWCM=" -> "Z3vcUrgyN0cGABMIWk8Boy1VBs3y8Xd6bW8qqz69Cgw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "EDu+4Xbfd16SVRTcGbd3erYMQbgN/mgikTP7H1OZz3w=" -> "YtZWFZ0ZIhxqfsmcI81VlVC4ZQXY12kfWkoF7TFO5gI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "NRGIpMvuI2g/jHxC02dHKIpAQsOVa+ED8pTGerDI+o0=" -> "s4whALCTnQi9ofyNnB+gmRn/IgklS7DIj8cexkQ5pcQ="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZT17nljKBhsGiExXynfaZcOlwC+bBnd+/SVUqwY1v94=" -> "9W0YQX798hRDpj5W/ebVRXWRXJ7HWct6Up0njLPhmjY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "Iqq3YckCBN0WTAtINnlMSzmGtFvJjwvBG1BWzY5MePE=" -> "9t1m/BqCSQkljyEEDbXqFs041zt7oMHSfYtuk7kTTKE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:29.048+0000" -> (known after apply)
      ~ source_code_hash               = "s7zR0z9POPE/e6j63GBOZ1JNa/w4xZ/nQ8RGuHQ4LPs=" -> "+uRfGPEmVkvMIIrG0j2oiFqAjzRCZSZ9hRoRfCUMv3A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "Bhqb6ui6BcwO5wPIuNKjsOdGg4tTVY0v0j2ksFDDK5E=" -> "7mVUoNt4po9KN7TJyovXq/yfD9ooRtIFpXy1phkljhE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "kbJTwmQpfn9OQ7v7xf6yMWPJtogJJ8huk6uLy1p0k6g=" -> "LndAAOKpFBnUruxo4p5lGGx1jcOxBAIch4QbkQGI8uo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "bBz9iKqFXZ5oGZfuctRZP+/DVQWYeaFjrgFSBsqVftU=" -> "8/H977mrXSfJw7XORmKTF/72qA7U9xjZy67mRqpgPs4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "yfG18UnEa8Si3yD0RVGEUQmCVjAFg7JL5oayJrdszVE=" -> "lyEm043zZ0HD5ek8bLSAJ9Qise3mJNF7WYrnQWrtn2o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "Q+ATtGUM4Ycsp7xBbqMlRHnTarlV29hPLUWQx6wdywQ=" -> "fB22GZFxqqvZ+X4xiowY6QN1UfVps8GtlhFd3aK0QzE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "NEWix2wfCHWigp/rGPp6MzQ2xDQUBbT78NQr8KfEtOw=" -> "hWRCcnDoHCD0YbumKD64IzPuS7pYyW6msWy5IEYiqNw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "AS++zzwQBkvk5Yj6qiEVa41By26MKRNb3+zkjzy4kw0=" -> "VnBpNrs9Yszn9lqBOzhfvxIhuglflhCi3hcDf6z4MJM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "m6HPI0pYQ3CGOsvKL23013faUx0I7EcAYVjWvuY4IxM=" -> "e8GyJRoX3RA/TE3evu5XZ8jXznXizF+rDDNL5Ya4YYg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "RRwQXcrQNgZ3Jv3Ylaa7OOoimSEplV+p1oSzjNNryH8=" -> "2aaVI3h9Do/fGShGArS5WxzNQKhcJF8Wpa+A5LdVHe8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "2ROWm3jLGrAeB4xiiwfnewdjPxgghOyYL9AwaaNCpq8=" -> "LeeHVFR9ye2e0umUWzSQwP2tfrkohy4rBUE3XVZEbsw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "wKepvwT6jx+NoQaT7az9pkS66R62lPlK1ls7KFoQ86s=" -> "K/E5F0nQ3Mw6LTB3HKoDjDiY+CwervlAAIXDhlORIiM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "iXwcJx1xH58F2KKBFhrWAfCa36T/zQaUanSbHXtLtbc=" -> "HXYi9iQ6zC14lNjxJBz+D2CsRUfGblOzycCm5OAKu3o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "1va9PXdpF2E58ZQs1/NkF7LO/5ErXlqA3EAVrjqaoC4=" -> "IT1e8OgNjXos9scN8xNl6lESJKQVqTHy7FhJc/r6dcM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "VOC80MSGwSZKu90RT5+fRGWKOmlWMvHlGapRkhH0kq8=" -> "QL+ZcUqVpBiA94i51suIddGaLcIyjbh6Hcno1bdsdXQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "xfq8hNaBTvHxwpjno1kUX/dghIzLSU7OAVm/EYxU2H4=" -> "dHGPrDlCUDX918ePDetcalgvXqzE3g95RMb2KkxM4rE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "yDbtUTMXcav1JJqHsKNV7N2byCXIX9A/hs47cD7pqvU=" -> "e3dqLrq+H5QJy1BzXYomfB9/PUrZXpv1J2h+6669AYA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "ct8Vvxdpr5Mm1v+3X0qCLmj0QJAQJwnH3H2JENv1S9g=" -> "IWpUL8ndp7V2VsqyhFPrC2WO27WKPF849wFUGmhbPcY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:27.474+0000" -> (known after apply)
      ~ source_code_hash               = "X3S3TNVnwLzZZDJ0o1Pl76zbFd6BGe1eVyrXQ4Gq5jQ=" -> "LYXUBQ2O/TUBT/r052H7b80FdwFA9eJyInYOwgcUuSE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-10-17T19:16:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "y9CAh/eiSIb/4eBz5rwF1eWLhB1ul1Eftv65+IsK7mA=" -> "Os1GwagULWUi1+KJLn/AFdkD7zJsYaBOXkjAivw8KFg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "nmgbEClnpQn/8CBpIlvglCfU/JCMtDxpRA9F+1tX3cs=" -> "cJ6XqbgXYIJQvOPMvt6hrz1zxDkvMPO7mIlA7ddWjgs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "UnAykZq0oRSsaGuNp/DZAa1Juu48M77k1tvyjlStUF8=" -> "tapGMe7LrqNTZMlKSIRhCkjtAmuIV0NmanIK4xRWu4E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "TII9KzTL8kfjQR5CsuEKJmtjTi1AbB0NFdOdeE3E2ro=" -> "qYRn3EJhKHV1IDxafHpx8HzuiTNDIDjd8VzsxjwoXyA="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "6vBYkANzSSZEHvwiB8r/0NS6gzPuM86Ak82CDbYg9Fs=" -> "pbB8I1uN5zPEJnYpiTlYKcqkmoi++lsJbyjXxEIk0w8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "OQBGmlhxzLK9d1hMB76DGXN8MYWFCwVqed1M1INrKvQ=" -> "si9kRzkdv0cKpkeUsrBJy0P1MIUpZOZ3VzsnZ1JdkYw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "kBP0/pruva19T7CVoJttksFOnGdD9EKDj8M1owir46U=" -> "z1Q5/jS0PcXMO/pr0rq0qL2YqGYhr7VSdxbyijnm5is="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:29.815+0000" -> (known after apply)
      ~ source_code_hash               = "qTTqw2sRQ53+Jn9C5+RTpJYm4xyDn8j364P3yzX3Wt0=" -> "xEwJRE2Y7afZFxlGrGpD5kAtMvXI+mIEYGZOOsIdQAQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "2AvEjneqTOWEZjdhnp8s8y4Gn7WgFRCVzKTHPspueug=" -> "SmdtmoD2Bf35k+nNAIAnd0zFezaqCV7/ouV+fD6Yd6I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-10-17T19:17:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "40zNJzZ19czzxc2OcYcLce7+ardm5BsZBRW36VuBKPY=" -> "89KNx3dXz17e6e8mFZH9UhtRVTlH56r1Qs81eDFjaDM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-10-17T19:18:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "PWLIdkSRaYfWnrxkwDyZYeIlYMw5A04KnfQgaFKS0HE=" -> "CbmmYMp/acgdJad6ExyHSAkhTeTOdRh+Uw2jFvRK0ig="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-10-17T19:16:40Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "pgdiga" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-10-17T19:16:39Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-10-17T19:16:39Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 85 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @kellycastrof, Action: `pull_request`*